; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v10)
             (pred_12 ?v11 ?v12)
             (pred_10 ?v5 ?v12)
             (pred_1 ?v4 ?v5 )
	     (pred_5 ?v5)
             (pred_2 ?v13)
             (pred_8 ?v11)
             (pred_3 ?v12)
             (pred_7 ?v5)
             (pred_6 ?v11)
             (pred_9 ?v5)
             (pred_4 ))



(:action op_4
:parameters (?v7 ?v6 ?v8 ?v3)
:precondition (and (pred_2 ?v7) (pred_2 ?v6) (pred_8 ?v8) (pred_3 ?v3)
          (pred_11 ?v7 ?v6) (pred_12 ?v8 ?v3)
                   (pred_10 ?v6 ?v3) (pred_5 ?v7) 
                   (pred_7 ?v6) (pred_6 ?v8))
:effect (and  (pred_9 ?v6) (not (pred_7 ?v6))))


(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_2 ?v7) (pred_2 ?v1)
               (pred_5 ?v7) (pred_11 ?v7 ?v1) (pred_9 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v7))))

(:action op_5
:parameters (?v7 ?v8)
:precondition (and (pred_2 ?v7) (pred_8 ?v8) 
                  (pred_5 ?v7) (pred_1 ?v8 ?v7) (pred_4 ))
:effect (and (pred_6 ?v8)
   (not (pred_1 ?v8 ?v7)) (not (pred_4 ))))


(:action op_1
:parameters (?v7 ?v2 ?v9)
:precondition (and (pred_2 ?v7) (pred_8 ?v2) (pred_8 ?v9)
                  (pred_5 ?v7) (pred_6 ?v9) (pred_1 ?v2 ?v7))
:effect (and (pred_6 ?v2) (pred_1 ?v9 ?v7)
        (not (pred_6 ?v9)) (not (pred_1 ?v2 ?v7))))

(:action op_3
:parameters (?v7 ?v8)
:precondition (and (pred_2 ?v7) (pred_8 ?v8) 
                  (pred_5 ?v7) (pred_6 ?v8))
:effect (and (pred_4 ) (pred_1 ?v8 ?v7) (not (pred_6 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_22 obj_26 obj_15 obj_23 obj_19 obj_13 obj_31 obj_29 obj_03 obj_04 obj_17 obj_20 obj_18 obj_27 obj_12 obj_30 obj_06 obj_05 obj_24 obj_16 obj_28 obj_11 obj_25 obj_10
    obj_02 obj_01 obj_14
    obj_21 obj_09 obj_07
    )

    (:init
       (pred_4)

       (pred_2 obj_08)
       (pred_2 obj_22)
       (pred_2 obj_26)
       (pred_2 obj_15)
       (pred_2 obj_23)
       (pred_2 obj_19)
       (pred_2 obj_13)
       (pred_2 obj_31)
       (pred_2 obj_29)
       (pred_2 obj_03)
       (pred_2 obj_04)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_18)
       (pred_2 obj_27)
       (pred_2 obj_12)
       (pred_2 obj_30)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_24)
       (pred_2 obj_16)
       (pred_2 obj_28)
       (pred_2 obj_11)
       (pred_2 obj_25)
       (pred_2 obj_10)
       (pred_3 obj_02)
       (pred_3 obj_01)
       (pred_3 obj_14)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_07)

       (pred_11 obj_08 obj_19)
       (pred_11 obj_08 obj_22)
       (pred_11 obj_22 obj_13)
       (pred_11 obj_22 obj_26)
       (pred_11 obj_22 obj_08)
       (pred_11 obj_26 obj_31)
       (pred_11 obj_26 obj_15)
       (pred_11 obj_26 obj_22)
       (pred_11 obj_15 obj_29)
       (pred_11 obj_15 obj_23)
       (pred_11 obj_15 obj_26)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_19 obj_04)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_13 obj_31)
       (pred_11 obj_13 obj_22)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_31 obj_20)
       (pred_11 obj_31 obj_29)
       (pred_11 obj_31 obj_26)
       (pred_11 obj_31 obj_13)
       (pred_11 obj_29 obj_18)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_29 obj_15)
       (pred_11 obj_29 obj_31)
       (pred_11 obj_03 obj_27)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_04 obj_19)
       (pred_11 obj_17 obj_30)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_20 obj_18)
       (pred_11 obj_20 obj_31)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_18 obj_05)
       (pred_11 obj_18 obj_27)
       (pred_11 obj_18 obj_29)
       (pred_11 obj_18 obj_20)
       (pred_11 obj_27 obj_24)
       (pred_11 obj_27 obj_03)
       (pred_11 obj_27 obj_18)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_30)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_30 obj_28)
       (pred_11 obj_30 obj_06)
       (pred_11 obj_30 obj_17)
       (pred_11 obj_30 obj_12)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_06 obj_30)
       (pred_11 obj_05 obj_25)
       (pred_11 obj_05 obj_24)
       (pred_11 obj_05 obj_18)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_24 obj_10)
       (pred_11 obj_24 obj_27)
       (pred_11 obj_24 obj_05)
       (pred_11 obj_16 obj_28)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_28 obj_11)
       (pred_11 obj_28 obj_30)
       (pred_11 obj_28 obj_16)
       (pred_11 obj_11 obj_25)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_28)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_25 obj_05)
       (pred_11 obj_25 obj_11)
       (pred_11 obj_10 obj_24)
       (pred_11 obj_10 obj_25)
       (pred_7 obj_24)
       (pred_7 obj_29)
       (pred_7 obj_12)
       (pred_10  obj_24 obj_02)
       (pred_10  obj_29 obj_01)
       (pred_10  obj_12 obj_14)
       (pred_9 obj_08)
       (pred_9 obj_22)
       (pred_9 obj_26)
       (pred_9 obj_15)
       (pred_9 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_9 obj_31)
       (pred_9 obj_03)
       (pred_9 obj_04)
       (pred_9 obj_17)
       (pred_9 obj_20)
       (pred_9 obj_18)
       (pred_9 obj_27)
       (pred_9 obj_30)
       (pred_9 obj_06)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_28)
       (pred_9 obj_11)
       (pred_9 obj_25)
       (pred_9 obj_10)

       (pred_12  obj_21 obj_02)
       (pred_12  obj_09 obj_01)
       (pred_12  obj_07 obj_14)
       (pred_1 obj_21 obj_05)
       (pred_1 obj_09 obj_25)
       (pred_1 obj_07 obj_16)
       (pred_5 obj_10)
    )

    (:goal (and
       (pred_1 obj_21 obj_19)
       (pred_1 obj_07 obj_20)
    ))
(:constraints
  (always (not (pred_5 obj_18)))
)
)

; plan
1. (op_2 obj_10 obj_25)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_25)
   goals met: 0 of 2
2. (op_2 obj_25 obj_05)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_05)
   goals met: 0 of 2
3. (op_5 obj_05 obj_21)
   deleted: (pred_1 obj_21 obj_05) (pred_4)
   added: (pred_6 obj_21)
   goals met: 0 of 2
4. (op_2 obj_05 obj_06)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_06)
   goals met: 0 of 2
5. (op_2 obj_06 obj_30)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_30)
   goals met: 0 of 2
6. (op_2 obj_30 obj_28)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_28)
   goals met: 0 of 2
7. (op_2 obj_28 obj_16)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_16)
   goals met: 0 of 2
8. (op_1 obj_16 obj_07 obj_21)
   deleted: (pred_6 obj_21) (pred_1 obj_07 obj_16)
   added: (pred_6 obj_07) (pred_1 obj_21 obj_16)
   goals met: 0 of 2
9. (op_4 obj_16 obj_12 obj_07 obj_14)
   deleted: (pred_7 obj_12)
   added: (pred_9 obj_12)
   goals met: 0 of 2
10. (op_2 obj_16 obj_12)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_12)
   goals met: 0 of 2
11. (op_3 obj_12 obj_07)
   deleted: (pred_6 obj_07)
   added: (pred_4) (pred_1 obj_07 obj_12)
   goals met: 0 of 2
12. (op_2 obj_12 obj_16)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_16)
   goals met: 0 of 2
13. (op_5 obj_16 obj_21)
   deleted: (pred_1 obj_21 obj_16) (pred_4)
   added: (pred_6 obj_21)
   goals met: 0 of 2
14. (op_2 obj_16 obj_12)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_12)
   goals met: 0 of 2
15. (op_2 obj_12 obj_04)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_04)
   goals met: 0 of 2
16. (op_2 obj_04 obj_19)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_19)
   goals met: 0 of 2
17. (op_3 obj_19 obj_21)
   deleted: (pred_6 obj_21)
   added: (pred_4) (pred_1 obj_21 obj_19)
   goals met: 1 of 2
18. (op_2 obj_19 obj_04)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_04)
   goals met: 1 of 2
19. (op_2 obj_04 obj_12)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_12)
   goals met: 1 of 2
20. (op_5 obj_12 obj_07)
   deleted: (pred_1 obj_07 obj_12) (pred_4)
   added: (pred_6 obj_07)
   goals met: 1 of 2
21. (op_2 obj_12 obj_04)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_04)
   goals met: 1 of 2
22. (op_2 obj_04 obj_17)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_17)
   goals met: 1 of 2
23. (op_2 obj_17 obj_20)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_20)
   goals met: 1 of 2
24. (op_3 obj_20 obj_07)
   deleted: (pred_6 obj_07)
   added: (pred_4) (pred_1 obj_07 obj_20)
   goals met: 2 of 2
